create_supply_port VDD -domain TOP
create_supply_port VSS -domain TOP

create_supply_net VDD -domain TOP
create_supply_net VSS -domain TOP

connect_supply_net VDD -ports VDD
connect_supply_net VSS -ports VSS

create_power_domain PD_TOP -include_scope
update_power_domain PD_TOP -primary_power_net VDD -primary_ground_net VSS

add_power_state PD_TOP -state ACTIVE {-supply_expr {VDD == 1.0 && VSS == 0.0}}
